experiments/socialnetwork_singlenode/expected_results/mixed_qps4000/wrk_warmup.log
Running 30s test @ http://ip-172-31-12-93.us-east-2.compute.internal:8080
  4 threads and 64 connections
  Thread calibration: mean lat.: 4.024ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 7.757ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.880ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.173ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.55ms    1.98ms  21.90ms   71.11%
    Req/Sec     1.17k   159.20     1.83k    66.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.71ms
 75.000%    5.24ms
 90.000%    6.63ms
 99.000%    8.70ms
 99.900%   10.73ms
 99.990%   13.91ms
 99.999%   20.56ms
100.000%   21.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.683     0.000000            1         1.00
       1.697     0.100000         8993         1.11
       1.985     0.200000        17954         1.25
       2.219     0.300000        26922         1.43
       2.449     0.400000        35880         1.67
       2.707     0.500000        44864         2.00
       2.861     0.550000        49363         2.22
       3.057     0.600000        53800         2.50
       3.347     0.650000        58275         2.86
       4.307     0.700000        62758         3.33
       5.239     0.750000        67255         4.00
       5.491     0.775000        69497         4.44
       5.711     0.800000        71743         5.00
       5.923     0.825000        73972         5.71
       6.139     0.850000        76213         6.67
       6.379     0.875000        78464         8.00
       6.495     0.887500        79575         8.89
       6.631     0.900000        80700        10.00
       6.771     0.912500        81809        11.43
       6.931     0.925000        82934        13.33
       7.119     0.937500        84048        16.00
       7.219     0.943750        84615        17.78
       7.331     0.950000        85164        20.00
       7.447     0.956250        85725        22.86
       7.587     0.962500        86290        26.67
       7.743     0.968750        86846        32.00
       7.839     0.971875        87129        35.56
       7.935     0.975000        87407        40.00
       8.047     0.978125        87686        45.71
       8.179     0.981250        87968        53.33
       8.327     0.984375        88262        64.00
       8.407     0.985938        88390        71.11
       8.511     0.987500        88526        80.00
       8.615     0.989062        88669        91.43
       8.759     0.990625        88809       106.67
       8.919     0.992188        88948       128.00
       8.999     0.992969        89018       142.22
       9.111     0.993750        89087       160.00
       9.199     0.994531        89158       182.86
       9.327     0.995313        89227       213.33
       9.487     0.996094        89296       256.00
       9.615     0.996484        89332       284.44
       9.743     0.996875        89365       320.00
       9.863     0.997266        89400       365.71
       9.999     0.997656        89435       426.67
      10.175     0.998047        89474       512.00
      10.239     0.998242        89489       568.89
      10.351     0.998437        89505       640.00
      10.495     0.998633        89524       731.43
      10.607     0.998828        89541       853.33
      10.791     0.999023        89558      1024.00
      10.951     0.999121        89568      1137.78
      11.055     0.999219        89575      1280.00
      11.151     0.999316        89584      1462.86
      11.263     0.999414        89594      1706.67
      11.463     0.999512        89602      2048.00
      11.559     0.999561        89606      2275.56
      11.807     0.999609        89610      2560.00
      12.055     0.999658        89615      2925.71
      12.191     0.999707        89619      3413.33
      12.415     0.999756        89624      4096.00
      12.463     0.999780        89626      4551.11
      12.615     0.999805        89628      5120.00
      12.703     0.999829        89630      5851.43
      12.759     0.999854        89632      6826.67
      13.751     0.999878        89635      8192.00
      13.911     0.999890        89636      9102.22
      13.943     0.999902        89637     10240.00
      14.095     0.999915        89638     11702.86
      14.135     0.999927        89639     13653.33
      14.575     0.999939        89640     16384.00
      14.711     0.999945        89641     18204.44
      14.711     0.999951        89641     20480.00
      15.815     0.999957        89642     23405.71
      15.815     0.999963        89642     27306.67
      18.303     0.999969        89643     32768.00
      18.303     0.999973        89643     36408.89
      18.303     0.999976        89643     40960.00
      20.559     0.999979        89644     46811.43
      20.559     0.999982        89644     54613.33
      20.559     0.999985        89644     65536.00
      20.559     0.999986        89644     72817.78
      20.559     0.999988        89644     81920.00
      21.919     0.999989        89645     93622.86
      21.919     1.000000        89645          inf
#[Mean    =        3.548, StdDeviation   =        1.983]
#[Max     =       21.904, Total count    =        89645]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.89ms
 75.000%    4.59ms
 90.000%    5.82ms
 99.000%    7.82ms
 99.900%    9.90ms
 99.990%   13.02ms
 99.999%   19.74ms
100.000%   20.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.540     0.000000            1         1.00
       1.134     0.100000         8978         1.11
       1.415     0.200000        17936         1.25
       1.581     0.300000        26939         1.43
       1.727     0.400000        35893         1.67
       1.893     0.500000        44847         2.00
       2.002     0.550000        49336         2.22
       2.149     0.600000        53821         2.50
       2.381     0.650000        58281         2.86
       3.621     0.700000        62752         3.33
       4.591     0.750000        67259         4.00
       4.799     0.775000        69502         4.44
       4.987     0.800000        71742         5.00
       5.175     0.825000        73968         5.71
       5.375     0.850000        76226         6.67
       5.587     0.875000        78461         8.00
       5.695     0.887500        79566         8.89
       5.819     0.900000        80685        10.00
       5.959     0.912500        81833        11.43
       6.111     0.925000        82938        13.33
       6.283     0.937500        84050        16.00
       6.383     0.943750        84626        17.78
       6.491     0.950000        85179        20.00
       6.591     0.956250        85725        22.86
       6.723     0.962500        86295        26.67
       6.871     0.968750        86844        32.00
       6.967     0.971875        87125        35.56
       7.063     0.975000        87412        40.00
       7.171     0.978125        87699        45.71
       7.303     0.981250        87965        53.33
       7.447     0.984375        88248        64.00
       7.539     0.985938        88387        71.11
       7.639     0.987500        88525        80.00
       7.739     0.989062        88665        91.43
       7.867     0.990625        88805       106.67
       8.015     0.992188        88946       128.00
       8.099     0.992969        89017       142.22
       8.207     0.993750        89091       160.00
       8.351     0.994531        89155       182.86
       8.463     0.995313        89232       213.33
       8.607     0.996094        89296       256.00
       8.695     0.996484        89332       284.44
       8.807     0.996875        89366       320.00
       8.927     0.997266        89400       365.71
       9.071     0.997656        89435       426.67
       9.263     0.998047        89472       512.00
       9.335     0.998242        89491       568.89
       9.407     0.998437        89505       640.00
       9.575     0.998633        89523       731.43
       9.735     0.998828        89540       853.33
       9.943     0.999023        89558      1024.00
      10.087     0.999121        89567      1137.78
      10.167     0.999219        89575      1280.00
      10.295     0.999316        89584      1462.86
      10.511     0.999414        89593      1706.67
      10.711     0.999512        89602      2048.00
      10.783     0.999561        89606      2275.56
      10.871     0.999609        89610      2560.00
      10.999     0.999658        89615      2925.71
      11.239     0.999707        89619      3413.33
      11.471     0.999756        89624      4096.00
      11.519     0.999780        89626      4551.11
      11.615     0.999805        89628      5120.00
      11.791     0.999829        89630      5851.43
      11.999     0.999854        89632      6826.67
      12.855     0.999878        89635      8192.00
      13.023     0.999890        89636      9102.22
      13.231     0.999902        89637     10240.00
      13.303     0.999915        89638     11702.86
      13.431     0.999927        89640     13653.33
      13.431     0.999939        89640     16384.00
      14.543     0.999945        89641     18204.44
      14.543     0.999951        89641     20480.00
      15.119     0.999957        89642     23405.71
      15.119     0.999963        89642     27306.67
      18.031     0.999969        89643     32768.00
      18.031     0.999973        89643     36408.89
      18.031     0.999976        89643     40960.00
      19.743     0.999979        89644     46811.43
      19.743     0.999982        89644     54613.33
      19.743     0.999985        89644     65536.00
      19.743     0.999986        89644     72817.78
      19.743     0.999988        89644     81920.00
      20.799     0.999989        89645     93622.86
      20.799     1.000000        89645          inf
#[Mean    =        2.831, StdDeviation   =        1.915]
#[Max     =       20.784, Total count    =        89645]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  134851 requests in 30.00s, 33.54MB read
  Non-2xx or 3xx responses: 1
Requests/sec:   4495.00
Transfer/sec:      1.12MB